Autodesk.Revit.DB.Toposolid.GetSubRegionOutline(System.Collections.Generic.IList{Autodesk.Revit.DB.FormaBuilding})
Get the subRegion outline
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.Toposolid.CreateSubDivisions(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,System.Collections.Generic.IList{Autodesk.Revit.DB.FormaRoad})
Creates a Toposolid subdivision element with the current Toposolid as its host.
document:
The document in which the new Toposolid is created.
topoTypeId:
Id of the Toposolid type to be used by the new subdivision.
formaRoads:
Polylines as road
Returns:
The Toposolid subdivision object.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Toposolid type is not valid for this Toposolid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.Toposolid.AddParam(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ParameterValue)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.Toposolid.SetCutVoidStability(Autodesk.Revit.DB.Document,System.Boolean)
Enables or disables the setting for stability of Boolean operations for Toposolid elements.
Remarks:
The stability setting increases the chance of cut and void operation success by applying a random shift
(a hyper-random testing action where the computer shifts the cut-void along the x or y axis, starting from the minimum distance).
Enabling this may slightly impact the accuracy of the geometry.
When used, the voided geometry is changed, and will be reported in a warning.
Please note that success cannot be guaranteed for Boolean operations when this setting is enabled.
document:
The document.
enable:
True means enable cut void stability setting, otherwise disable.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2026

Autodesk.Revit.DB.Toposolid.IsCutVoidStabilityEnabled(Autodesk.Revit.DB.Document)
Identifies if the setting for stability of Boolean operations for Toposolid elements is enabled or disabled.
Remarks:
The stability setting increases the chance of cut and void operation success by applying a random shift
(a hyper-random testing action where the computer shifts the cut-void along the x or y axis, starting from the minimum distance).
Enabling this may slightly impact the accuracy of the geometry.
When used, the voided geometry is changed, and will be reported in a warning.
Please note that success cannot be guaranteed for Boolean operations when this setting is enabled.
document:
The document.
Returns:
True means enable cut void stability setting, otherwise disable.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2026

Autodesk.Revit.DB.Toposolid.SetSmoothedSurface(Autodesk.Revit.DB.Document,System.Boolean)
Sets smoothed surface setting of Toposolid.
document:
The document.
enable:
True means enable smoothed surface setting, otherwise disable.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.Toposolid.IsSmoothedSurfaceEnabled(Autodesk.Revit.DB.Document)
Gets smoothed surface setting of Toposolid.
document:
The document.
Returns:
True if smoothed surface is enabled for Toposolid, otherwise return false.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.Toposolid.CanBeExcavatedBy(Autodesk.Revit.DB.ElementId)
Checks if the given element can be used to excavate the Toposolid.
elementId:
Id of the element
Returns:
True if the element can be used to excavate the Toposolid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.Toposolid.RemoveExcavationBy(Autodesk.Revit.DB.ElementId)
Removes the excavation between the given element and the Toposolid.
elementId:
Id of the element that already excavates the Toposolid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The element is not supported for Toposolid excavation operations.
Since:
2025

Autodesk.Revit.DB.Toposolid.ExcavateBy(Autodesk.Revit.DB.ElementId)
Excavates the Toposolid by a given element.
elementId:
Id of the element used to excavate the Toposolid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The element is not supported for Toposolid excavation operations.
Since:
2025

Autodesk.Revit.DB.Toposolid.Simplify(System.Double)
Simplifies the Toposolid by reducing the number of inner vertices to the given percentage.
Remarks:
At low percentages, the inner vertices may not be reduced to the exact percentage to keep a rough semblance of the original shape.
Call this method again if you want to keep removing inner vertices.
percentage:
The ratio of the number of inner vertices after simplify to the original number.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input percentage should be greater than 0 and less than 1.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
this operation failed.
Since:
2024

Autodesk.Revit.DB.Toposolid.Split(System.Collections.Generic.IList{Autodesk.Revit.DB.CurveLoop})
Splits the Toposolid by the given curve loops.
splitCurveLoops:
An array of planar curve loops that are used to split the Toposolid.
All of the curve loops should lie on the sketch plane of the Toposolid.
Returns:
An array of newly created Toposolid ids after split.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The split curve loops should all lie on the sketch plane of the Toposolid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.Toposolid.GetSubDivisionIds
Gets all element ids of Toposolid subdivisions with the current Toposolid as its host.
Returns:
The array of Toposolid subdivision ids.
Since:
2024

Autodesk.Revit.DB.Toposolid.CreateSubDivision(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,System.Collections.Generic.IList{Autodesk.Revit.DB.CurveLoop})
Creates a Toposolid subdivision element with the current Toposolid as its host.
document:
The document in which the new Toposolid is created.
topoTypeId:
Id of the Toposolid type to be used by the new subdivision.
profiles:
An array of planar curve loops that represent the profiles of the Toposolid.
Returns:
The Toposolid subdivision object.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input curve loops cannot compose a valid boundary, that means:
the "curveLoops" collection is empty;
or some curve loops intersect with each other;
or each curve loop is not closed individually;
or each curve loop is not planar;
or each curve loop is not in a plane parallel to the horizontal(XY) plane;
or input curves contain at least one helical curve.
-or-
Toposolid type is not valid for this Toposolid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.Toposolid.CreateSubDivision(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.CurveLoop})
Creates a Toposolid subdivision element with the current Toposolid as its host, using the default Toposolid type as the type of the new subdivision.
Remarks:
By using this method, a default Toposolid type will be used as the element type.
document:
The document in which the new Toposolid is created.
profiles:
An array of planar curve loops that represent the profiles of the Toposolid.
Returns:
The Toposolid subdivision object.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input curve loops cannot compose a valid boundary, that means:
the "curveLoops" collection is empty;
or some curve loops intersect with each other;
or each curve loop is not closed individually;
or each curve loop is not planar;
or each curve loop is not in a plane parallel to the horizontal(XY) plane;
or input curves contain at least one helical curve.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.Toposolid.CreateFromTopographySurface(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Creates a Toposolid element from a host TopographySurface, and Toposolid sub-divisions from its subregions.
document:
The document in which the new Toposolid is created.
hostSurfaceId:
Id of the host TopogarphySurface element.
topoTypeId:
Id of the Toposolid type to be used by the new Toposolid.
levelId:
Id of the level on which the Toposolid is to be placed.
Returns:
A new Toposolid object within the project if successful.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.Toposolid.Create(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.CurveLoop},System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ},Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Creates a new instance of Toposolid within the project.
document:
The document in which the new Toposolid is created.
profiles:
An array of planar curve loops that represent the profiles of the Toposolid.
points:
An array of points that used to construct the top face of the Toposolid.
topoTypeId:
Id of the Toposolid type to be used by the new Toposolid.
levelId:
Id of the level on which the Toposolid is to be placed.
Returns:
A new Toposolid object within the project if successful.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input curve loops cannot compose a valid boundary, that means:
the "curveLoops" collection is empty;
or some curve loops intersect with each other;
or each curve loop is not closed individually;
or each curve loop is not planar;
or each curve loop is not in a plane parallel to the horizontal(XY) plane;
or input curves contain at least one helical curve.
-or-
The ElementId levelId is not a Level.
-or-
Toposolid type is not valid for this Toposolid.
-or-
Input curves build invalid sketch.
-or-
Failed to create curve elements.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Cannot generate a sketch.
-or-
Failed to create new element.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2024

Autodesk.Revit.DB.Toposolid.Create(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ},Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Creates a new instance of Toposolid within the project.
document:
The document in which the new Toposolid is created.
points:
An array of points that used to construct the top face of the Toposolid.
topoTypeId:
Id of the Toposolid type to be used by the new Toposolid.
levelId:
Id of the level on which the Toposolid is to be placed.
Returns:
A new Toposolid object within the project if successful.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input point array size is less than 3.
-or-
The ElementId levelId is not a Level.
-or-
Toposolid type is not valid for this Toposolid.
-or-
Input curves build invalid sketch.
-or-
Failed to create curve elements.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Cannot generate a sketch.
-or-
Failed to create new element.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2024

Autodesk.Revit.DB.Toposolid.Create(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.CurveLoop},Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Creates a new instance of Toposolid within the project.
document:
The document in which the new Toposolid is created.
profiles:
An array of planar curve loops that represent the profiles of the Toposolid.
topoTypeId:
Id of the Toposolid type to be used by the new Toposolid.
levelId:
Id of the level on which the Toposolid is to be placed.
Returns:
A new Toposolid object within the project if successful.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input curve loops cannot compose a valid boundary, that means:
the "curveLoops" collection is empty;
or some curve loops intersect with each other;
or each curve loop is not closed individually;
or each curve loop is not planar;
or each curve loop is not in a plane parallel to the horizontal(XY) plane;
or input curves contain at least one helical curve.
-or-
The ElementId levelId is not a Level.
-or-
Toposolid type is not valid for this Toposolid.
-or-
Input curves build invalid sketch.
-or-
Failed to create curve elements.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Cannot generate a sketch.
-or-
Failed to create new element.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2024

Autodesk.Revit.DB.Toposolid.HostTopoId
The host Toposolid id of the current Toposolid subdivision.
If the object is not a Toposolid subdivision, hostTopoId will be InvalidElementId.
Since:
2024